**Lab 2:** Łączenie z bazą danych i instrukcja select<br>
Jakub Bajek 405238

Połączenie z bazą danych przy pomocy sqlAlchemy

In [1]:
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

### Wykonanie zadań

**Zadanie 1:** Ile kategorii filmów mamy w wypożyczalni?

In [22]:
result_set = db.execute("SELECT * FROM category")  
count = result_set.rowcount
print('Mamy {} kategorii filmów'.format(count))

Mamy 16 kategorii filmów

**Zadanie 2:** Wyświetl listę kategorii w kolejności alfabetycznej.

In [23]:
result_set = db.execute("SELECT * FROM category ORDER BY name ASC")
print('Kategorie filmów alfabetycznie:')
for r in result_set:  
    print(r[1])

Kategorie filmów alfabetycznie:
Action
Animation
Children
Classics
Comedy
Documentary
Drama
Family
Foreign
Games
Horror
Music
New
Sci-Fi
Sports
Travel

**Zadanie 3:** Znajdź najstarszy i najmłodszy film do wypożyczenia. **POPRAWIONE**

In [3]:
result_set = db.execute("SELECT film_id, title, release_year\
                        FROM film\
                        ORDER BY release_year ASC\
                        LIMIT 1")
for r in result_set:  
    print('Najmłodszy film to',r)   
                                                              
result_set = db.execute("SELECT film_id, title, release_year\
                        FROM film\
                        ORDER BY release_year DESC\
                        LIMIT 1")
for r in result_set:  
    print('Najstarszy film to',r)  
                                                              
#Nie sprawdzam możliwości istnienia kilku najmłodszych o tej samej dacie wydania - musiałbym wypisać wszystkie filmy

Najmłodszy film to (133, 'Chamber Italian', 2006)
Najstarszy film to (133, 'Chamber Italian', 2006)

**Zadanie 4:** Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [67]:
result_set = db.execute("SELECT rental_date\
                        FROM rental\
                        WHERE rental_date >= '2005-07-01' AND rental_date < '2005-08-01'")
count = result_set.rowcount
print('Między 2005-07-01 a 2005-08-01 było {} wypożyczeń.'.format(count))

Między 2005-07-01 a 2005-08-01 było 6709 wypożyczeń.

**Zadanie 5:** Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [69]:
result_set = db.execute("SELECT rental_date\
                        FROM rental\
                        WHERE rental_date >= '2010-01-01' AND rental_date < '2011-02-01'")
count = result_set.rowcount
print('Między 2010-01-01 a 2011-02-01 było {} wypożyczeń.'.format(count))

Między 2010-01-01 a 2011-02-01 było 0 wypożyczeń.

**Zadanie 6:** Znajdź największą płatność wypożyczenia

In [102]:
result_set = db.execute("SELECT DISTINCT amount\
                        FROM payment\
                        ORDER BY amount DESC\
                        LIMIT 1")
max_value = None
for r in result_set:
    max_value = r[0]
print('Najwyższa wartość wypożyczenia wynosi: {}'.format(max_value))

Najwyższa wartość wypożyczenia wynosi: 11.99

**Zadanie 7:** Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu. <br>
W zadaniu do tabeli customer, za pomocą dyrektywy INNER JOIN dołączyłem tabelę address po wspólnym address_id, z tej tabeli po wspólnym city_id dołączyłem tabelę city, aż w końcu po country_id z tabeli city ostatecznie tabelę country, którą przefiltrowałem

In [113]:
result_set = db.execute("\
    SELECT cu.customer_id, cu.first_name, cu.last_name, co.country\
    FROM customer cu\
    \
    INNER JOIN address ad\
    ON cu.address_id = ad.address_id\
    \
    INNER JOIN city ci\
    ON ad.city_id = ci.city_id\
    \
    INNER JOIN country co\
    ON ci.country_id = co.country_id\
    \
    WHERE co.country='Bangladesh' OR co.country='Poland' OR co.country='Nigeria'\
    ORDER BY co.country, cu.customer_id ASC")
for r in result_set:  
    print(r)

(21, 'Michelle', 'Clark', 'Bangladesh')
(329, 'Frank', 'Waggoner', 'Bangladesh')
(332, 'Stephen', 'Qualls', 'Bangladesh')
(18, 'Carol', 'Garcia', 'Nigeria')
(80, 'Marilyn', 'Ross', 'Nigeria')
(103, 'Gladys', 'Hamilton', 'Nigeria')
(156, 'Bertha', 'Ferguson', 'Nigeria')
(198, 'Elsie', 'Kelley', 'Nigeria')
(232, 'Constance', 'Reid', 'Nigeria')
(250, 'Jo', 'Fowler', 'Nigeria')
(277, 'Olga', 'Jimenez', 'Nigeria')
(280, 'Tracey', 'Barrett', 'Nigeria')
(284, 'Sonia', 'Gregory', 'Nigeria')
(286, 'Velma', 'Lucas', 'Nigeria')
(409, 'Rodney', 'Moeller', 'Nigeria')
(562, 'Wallace', 'Slone', 'Nigeria')
(128, 'Marjorie', 'Tucker', 'Poland')
(270, 'Leah', 'Curtis', 'Poland')
(318, 'Brian', 'Wyman', 'Poland')
(380, 'Russell', 'Brinson', 'Poland')
(501, 'Ruben', 'Geary', 'Poland')
(558, 'Jimmie', 'Eggleston', 'Poland')
(571, 'Johnnie', 'Chisholm', 'Poland')
(572, 'Sidney', 'Burleson', 'Poland')

**Zadanie 8:** Gdzie mieszkają członkowie personelu?<br>
Podobnie jak w poprzednim zadaniu z wykorzystaniem klauzuli INNER JOIN doszedłem do adresu zamieszkania członków personelu przez wspólny "address_id", podobnie uzyskałem miasto i kraj

In [19]:
result_set = db.execute("\
    SELECT s.staff_id,s.first_name, s.last_name,a.address,c.city,co.country\
    FROM staff s\
    \
    INNER JOIN address a\
    ON s.address_id = a.address_id\
    \
    INNER JOIN city c\
    ON a.city_id = c.city_id\
    \
    INNER JOIN country co\
    ON c.country_id = co.country_id")
for r in result_set:
    print(r)

(1, 'Mike', 'Hillyer', '23 Workhaven Lane', 'Lethbridge', 'Canada')
(2, 'Jon', 'Stephens', '1411 Lillydale Drive', 'Woodridge', 'Australia')

**Zadanie 9:** Ilu pracowników mieszka w Argentynie lub Hiszpanii?<br>
Do kodu z poprzedniego zadania dodałem filtrację krajów i zliczenie

In [27]:
result_set = db.execute("\
    SELECT s.staff_id,s.first_name, s.last_name,a.address,c.city,co.country\
    FROM staff s\
    \
    INNER JOIN address a\
    ON s.address_id = a.address_id\
    \
    INNER JOIN city c\
    ON a.city_id = c.city_id\
    \
    INNER JOIN country co\
    ON c.country_id = co.country_id\
    \
    WHERE co.country IN ('Argentina', 'Spain')")
count = result_set.rowcount
print('Jest {} pracownikow z Argentyny i Hiszpani'.format(count))
for r in result_set: #Wyświetlenie listy tych pracownikóœ
    print(r)

Jest 0 pracownikow z Argentyny i Hiszpani

**Zadanie 10:** Jakie kategorie filmów zostały wypożyczone przez klientów? <br>
Ponownie użyłem INNER JOIN do uzyskania kategorii filmów wychodząc z tabeli rental

In [42]:
result_set = db.execute("\
    SELECT DISTINCT c.name\
    FROM rental r\
    \
    INNER JOIN inventory i\
    ON r.inventory_id = i.inventory_id\
    \
    INNER JOIN film_category fc\
    ON i.film_id = fc.film_id\
    \
    INNER JOIN category c\
    ON c.category_id = fc.category_id\
    \
    ORDER BY c.name ASC")
print('Wypozyczone kategorie filmów to:')
for r in result_set:
    print(r[0])

Wypozyczone kategorie filmów to:
Action
Animation
Children
Classics
Comedy
Documentary
Drama
Family
Foreign
Games
Horror
Music
New
Sci-Fi
Sports
Travel

**Zadanie 11**: Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce. <br>
Do kodu z poprzedniego zadania dodałem kraj do, którego doszedłem przez customer_id z tabeli rental i korzystająć z INNER JOIN jak w poprzednich zadaniach<br>
Uzyłem kraju pochodzenia osoby wypożyczające, brak tablicy zawierającej kontynenty, do filtru wpisałem najpopoularniejsze i występujące w bazie państwa Ameryki

In [4]:
result_set = db.execute("\
    SELECT DISTINCT ca.name\
    FROM rental r\
    \
    INNER JOIN inventory i\
    ON r.inventory_id = i.inventory_id\
    \
    INNER JOIN film_category fc\
    ON i.film_id = fc.film_id\
    \
    INNER JOIN category ca\
    ON ca.category_id = fc.category_id\
    \
    INNER JOIN customer cu\
    ON cu.customer_id = r.customer_id\
    \
    INNER JOIN address a\
    ON cu.address_id = a.address_id\
    \
    INNER JOIN city ci\
    ON a.city_id = ci.city_id\
    \
    INNER JOIN country co\
    ON ci.country_id = co.country_id\
    \
    WHERE co.country IN ('United States','Brazil','Mexico','Colombia','Argentina','Canada','Peru','Venezuela','Chile',\
    'Ecuador','Guatemala','Bolivia','Haiti','Cuba','Dominican Republic','Paraguey','Honduras','El Salvador','Nicaragua',\
    'Costa Rica','Panama','Uruguay','Puerto Rico')\
    ORDER BY ca.name ASC")
print('Wypozyczone kategorie filmów przez osoby z Ameryki":')
for r in result_set:
    print(r[0])

Wypozyczone kategorie filmów przez osoby z Ameryki":
Action
Animation
Children
Classics
Comedy
Documentary
Drama
Family
Foreign
Games
Horror
Music
New
Sci-Fi
Sports
Travel

**Zadanie 12:** Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [11]:
result_set = db.execute("\
    SELECT a.first_name, a.last_name, f.title\
    FROM film f\
    \
    INNER JOIN film_actor fa\
    ON f.film_id = fa.film_id\
    \
    INNER JOIN actor a\
    ON fa.actor_id = a.actor_id\
    \
    WHERE (a.first_name='Olympia' AND a.last_name='Pfeiffer') OR\
    a.first_name='Julia' AND a.last_name='Zellweger' OR\
    a.first_name='Ellen' AND a.last_name='Presley'\
    \
    ORDER BY a.last_name ASC, f.title ASC")
for r in result_set:
    print(r)

('Olympia', 'Pfeiffer', 'Badman Dawn')
('Olympia', 'Pfeiffer', 'Chitty Lock')
('Olympia', 'Pfeiffer', 'Color Philadelphia')
('Olympia', 'Pfeiffer', 'Contact Anonymous')
('Olympia', 'Pfeiffer', 'Deep Crusade')
('Olympia', 'Pfeiffer', 'Effect Gladiator')
('Olympia', 'Pfeiffer', 'Express Lonely')
('Olympia', 'Pfeiffer', 'Firehouse Vietnam')
('Olympia', 'Pfeiffer', 'Fugitive Maguire')
('Olympia', 'Pfeiffer', 'Hanky October')
('Olympia', 'Pfeiffer', 'Ice Crossing')
('Olympia', 'Pfeiffer', 'Idols Snatchers')
('Olympia', 'Pfeiffer', 'Intolerable Intentions')
('Olympia', 'Pfeiffer', 'Magnolia Forrester')
('Olympia', 'Pfeiffer', 'Mars Roman')
('Olympia', 'Pfeiffer', 'Maude Mod')
('Olympia', 'Pfeiffer', 'Murder Antitrust')
('Olympia', 'Pfeiffer', 'None Spiking')
('Olympia', 'Pfeiffer', 'Others Soup')
('Olympia', 'Pfeiffer', 'Psycho Shrunk')
('Olympia', 'Pfeiffer', 'Santa Paris')
('Olympia', 'Pfeiffer', 'Sense Greek')
('Olympia', 'Pfeiffer', 'Storm Happiness')
('Olympia', 'Pfeiffer', 'Sweet Brotherhood')
('Olympia', 'Pfeiffer', 'Titanic Boondock')
('Olympia', 'Pfeiffer', 'Tourist Pelican')
('Olympia', 'Pfeiffer', 'Traffic Hobbit')
('Olympia', 'Pfeiffer', 'Wait Cider')
('Ellen', 'Presley', 'Bilko Anonymous')
('Ellen', 'Presley', 'Caribbean Liberty')
('Ellen', 'Presley', 'Casper Dragonfly')
('Ellen', 'Presley', 'Empire Malkovich')
('Ellen', 'Presley', 'Floats Garden')
('Ellen', 'Presley', 'Frogmen Breaking')
('Ellen', 'Presley', 'Homeward Cider')
('Ellen', 'Presley', 'Hyde Doctor')
('Ellen', 'Presley', 'Image Princess')
('Ellen', 'Presley', 'Jacket Frisco')
('Ellen', 'Presley', 'Microcosmos Paradise')
('Ellen', 'Presley', 'Network Peak')
('Ellen', 'Presley', 'Oscar Gold')
('Ellen', 'Presley', 'Pickup Driving')
('Ellen', 'Presley', 'Pinocchio Simon')
('Ellen', 'Presley', 'Private Drop')
('Ellen', 'Presley', 'Roots Remember')
('Ellen', 'Presley', 'Scarface Bang')
('Ellen', 'Presley', 'Secretary Rouge')
('Ellen', 'Presley', 'Spy Mile')
('Ellen', 'Presley', 'Streetcar Intentions')
('Ellen', 'Presley', 'Tadpole Park')
('Ellen', 'Presley', 'Treasure Command')
('Ellen', 'Presley', 'Turn Star')
('Ellen', 'Presley', 'Women Dorado')
('Julia', 'Zellweger', 'Breakfast Goldfinger')
('Julia', 'Zellweger', 'Cranes Reservoir')
('Julia', 'Zellweger', 'Dares Pluto')
('Julia', 'Zellweger', 'Detective Vision')
('Julia', 'Zellweger', 'Divorce Shining')
('Julia', 'Zellweger', 'Hollow Jeopardy')
('Julia', 'Zellweger', 'Jeopardy Encino')
('Julia', 'Zellweger', 'Lambs Cincinatti')
('Julia', 'Zellweger', 'Majestic Floats')
('Julia', 'Zellweger', 'Minds Truman')
('Julia', 'Zellweger', 'Open African')
('Julia', 'Zellweger', 'Outlaw Hanky')
('Julia', 'Zellweger', 'Panky Submarine')
('Julia', 'Zellweger', 'Rider Caddyshack')
('Julia', 'Zellweger', 'Won Dares')
('Julia', 'Zellweger', 'Wyoming Storm')